int/resources/objectRepo/xmlTemplates/opera/Channel/req_CreateChannelRoomMapping.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/par/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateChannelRoomMappingRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:ChannelRoomMappings>
            <v91:ChannelRoomMapping BeginDate="?" BookingChannelCode="?" ChannelRoomType="?" HotelCode="?" RoomType="?">
               <v91:EndDate/>
               <v91:Description>
                  <v91:RoomTypeDescription>
                     <v91:EnhancedDescription>
                        <v91:EnhancedDescriptionLine1>
                           <v91:DefaultText/>
                           <v91:TranslatedTexts>
                              <v91:Text Lang="?"/>
                           </v91:TranslatedTexts>
                        </v91:EnhancedDescriptionLine1>
                        <v91:EnhancedDescriptionLine2>
                           <v91:DefaultText/>
                           <v91:TranslatedTexts>
                              <v91:Text Lang="?"/>
                           </v91:TranslatedTexts>
                        </v91:EnhancedDescriptionLine2>
                        <v91:EnhancedDescriptionLine3>
                           <v91:DefaultText/>
                           <v91:TranslatedTexts>
                              <v91:Text Lang="?"/>
                           </v91:TranslatedTexts>
                        </v91:EnhancedDescriptionLine3>
                     </v91:EnhancedDescription>
                     <v91:HTMLSupportedDescription>
                        <v91:Description/>
                        <v91:ShortDescription/>
                     </v91:HTMLSupportedDescription>
                     <v91:Description/>
                  </v91:RoomTypeDescription>
                  <v91:GlobalDescription>
                     <v91:EnhancedDescriptionLine1>
                        <v91:DefaultText/>
                        <v91:TranslatedTexts>
                           <v91:Text Lang="?"/>
                        </v91:TranslatedTexts>
                     </v91:EnhancedDescriptionLine1>
                     <v91:EnhancedDescriptionLine2>
                        <v91:DefaultText/>
                        <v91:TranslatedTexts>
                           <v91:Text Lang="?"/>
                        </v91:TranslatedTexts>
                     </v91:EnhancedDescriptionLine2>
                     <v91:EnhancedDescriptionLine3>
                        <v91:DefaultText/>
                        <v91:TranslatedTexts>
                           <v91:Text Lang="?"/>
                        </v91:TranslatedTexts>
                     </v91:EnhancedDescriptionLine3>
                  </v91:GlobalDescription>
                  <v91:CustomDescription>
                     <v91:EnhancedDescription>
                        <v91:EnhancedDescriptionLine1>
                           <v91:DefaultText/>
                           <v91:TranslatedTexts>
                              <v91:Text Lang="?"/>
                           </v91:TranslatedTexts>
                        </v91:EnhancedDescriptionLine1>
                        <v91:EnhancedDescriptionLine2>
                           <v91:DefaultText/>
                           <v91:TranslatedTexts>
                              <v91:Text Lang="?"/>
                           </v91:TranslatedTexts>
                        </v91:EnhancedDescriptionLine2>
                        <v91:EnhancedDescriptionLine3>
                           <v91:DefaultText/>
                           <v91:TranslatedTexts>
                              <v91:Text Lang="?"/>
                           </v91:TranslatedTexts>
                        </v91:EnhancedDescriptionLine3>
                     </v91:EnhancedDescription>
                     <v91:HTMLSupportedDescription>
                        <v91:Description/>
                        <v91:ShortDescription/>
                     </v91:HTMLSupportedDescription>
                     <v91:Description/>
                  </v91:CustomDescription>
               </v91:Description>
               <v91:AlternateChannelRoomType/>
               <v91:ChannelRoomTypeOrder/>
               <v91:SellSequence/>
               <v91:Active/>
               <v91:BedTypeCode/>
               <v91:BaseAllocation/>
               <v91:NewChannelRoomType/>
               <v91:NewBeginDate/>
               <v91:BookingChannelInfo BookingChannelCode="?" BookingChannelType="?" Name="?">
                  <v91:HotelMappings>
                     <v91:HotelMapping Code="?" Description="?" HotelCode="?" Name="?"/>
                  </v91:HotelMappings>
                  <v91:ConfigurationParameters>
                     <v91:Parameter>
                        <v91:ParameterName/>
                        <v91:ParameterValue/>
                     </v91:Parameter>
                  </v91:ConfigurationParameters>
               </v91:BookingChannelInfo>
               <v91:GlobalDescription>
                  <v91:EnhancedDescriptionLine1>
                     <v91:DefaultText/>
                     <v91:TranslatedTexts>
                        <v91:Text Lang="?"/>
                     </v91:TranslatedTexts>
                  </v91:EnhancedDescriptionLine1>
                  <v91:EnhancedDescriptionLine2>
                     <v91:DefaultText/>
                     <v91:TranslatedTexts>
                        <v91:Text Lang="?"/>
                     </v91:TranslatedTexts>
                  </v91:EnhancedDescriptionLine2>
                  <v91:EnhancedDescriptionLine3>
                     <v91:DefaultText/>
                     <v91:TranslatedTexts>
                        <v91:Text Lang="?"/>
                     </v91:TranslatedTexts>
                  </v91:EnhancedDescriptionLine3>
               </v91:GlobalDescription>
               <v91:ChannelRoomMappingDetails>
                  <v91:EndDate/>
                  <v91:Description>
                     <v91:RoomTypeDescription>
                        <v91:EnhancedDescription>
                           <v91:EnhancedDescriptionLine1>
                              <v91:DefaultText/>
                              <v91:TranslatedTexts>
                                 <v91:Text Lang="?"/>
                              </v91:TranslatedTexts>
                           </v91:EnhancedDescriptionLine1>
                           <v91:EnhancedDescriptionLine2>
                              <v91:DefaultText/>
                              <v91:TranslatedTexts>
                                 <v91:Text Lang="?"/>
                              </v91:TranslatedTexts>
                           </v91:EnhancedDescriptionLine2>
                           <v91:EnhancedDescriptionLine3>
                              <v91:DefaultText/>
                              <v91:TranslatedTexts>
                                 <v91:Text Lang="?"/>
                              </v91:TranslatedTexts>
                           </v91:EnhancedDescriptionLine3>
                        </v91:EnhancedDescription>
                        <v91:HTMLSupportedDescription>
                           <v91:Description/>
                           <v91:ShortDescription/>
                        </v91:HTMLSupportedDescription>
                        <v91:Description/>
                     </v91:RoomTypeDescription>
                     <v91:GlobalDescription>
                        <v91:EnhancedDescriptionLine1>
                           <v91:DefaultText/>
                           <v91:TranslatedTexts>
                              <v91:Text Lang="?"/>
                           </v91:TranslatedTexts>
                        </v91:EnhancedDescriptionLine1>
                        <v91:EnhancedDescriptionLine2>
                           <v91:DefaultText/>
                           <v91:TranslatedTexts>
                              <v91:Text Lang="?"/>
                           </v91:TranslatedTexts>
                        </v91:EnhancedDescriptionLine2>
                        <v91:EnhancedDescriptionLine3>
                           <v91:DefaultText/>
                           <v91:TranslatedTexts>
                              <v91:Text Lang="?"/>
                           </v91:TranslatedTexts>
                        </v91:EnhancedDescriptionLine3>
                     </v91:GlobalDescription>
                     <v91:CustomDescription>
                        <v91:EnhancedDescription>
                           <v91:EnhancedDescriptionLine1>
                              <v91:DefaultText/>
                              <v91:TranslatedTexts>
                                 <v91:Text Lang="?"/>
                              </v91:TranslatedTexts>
                           </v91:EnhancedDescriptionLine1>
                           <v91:EnhancedDescriptionLine2>
                              <v91:DefaultText/>
                              <v91:TranslatedTexts>
                                 <v91:Text Lang="?"/>
                              </v91:TranslatedTexts>
                           </v91:EnhancedDescriptionLine2>
                           <v91:EnhancedDescriptionLine3>
                              <v91:DefaultText/>
                              <v91:TranslatedTexts>
                                 <v91:Text Lang="?"/>
                              </v91:TranslatedTexts>
                           </v91:EnhancedDescriptionLine3>
                        </v91:EnhancedDescription>
                        <v91:HTMLSupportedDescription>
                           <v91:Description/>
                           <v91:ShortDescription/>
                        </v91:HTMLSupportedDescription>
                        <v91:Description/>
                     </v91:CustomDescription>
                  </v91:Description>
                  <v91:AlternateChannelRoomType/>
                  <v91:ChannelRoomTypeOrder/>
                  <v91:SellSequence/>
                  <v91:Active/>
                  <v91:BedTypeCode/>
                  <v91:BaseAllocation/>
                  <v91:NewChannelRoomType/>
                  <v91:NewBeginDate/>
                  <v91:BookingChannelInfo BookingChannelCode="?" BookingChannelType="?" Name="?">
                     <v91:HotelMappings>
                        <v91:HotelMapping Code="?" Description="?" HotelCode="?" Name="?"/>
                     </v91:HotelMappings>
                     <v91:ConfigurationParameters>
                        <v91:Parameter>
                           <v91:ParameterName/>
                           <v91:ParameterValue/>
                        </v91:Parameter>
                     </v91:ConfigurationParameters>
                  </v91:BookingChannelInfo>
                  <v91:GlobalDescription>
                     <v91:EnhancedDescriptionLine1>
                        <v91:DefaultText/>
                        <v91:TranslatedTexts>
                           <v91:Text Lang="?"/>
                        </v91:TranslatedTexts>
                     </v91:EnhancedDescriptionLine1>
                     <v91:EnhancedDescriptionLine2>
                        <v91:DefaultText/>
                        <v91:TranslatedTexts>
                           <v91:Text Lang="?"/>
                        </v91:TranslatedTexts>
                     </v91:EnhancedDescriptionLine2>
                     <v91:EnhancedDescriptionLine3>
                        <v91:DefaultText/>
                        <v91:TranslatedTexts>
                           <v91:Text Lang="?"/>
                        </v91:TranslatedTexts>
                     </v91:EnhancedDescriptionLine3>
                  </v91:GlobalDescription>
               </v91:ChannelRoomMappingDetails>
            </v91:ChannelRoomMapping>
         </v9:ChannelRoomMappings>
      </v9:CreateChannelRoomMappingRQ>
   </soapenv:Body>
</soapenv:Envelope>